#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/racklabs/terraform-demo/runs/run-3ByqsjVyEswEYhFR

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc.terraform-vpc: Refreshing state... [id=vpc-01190927a50846d36]
aws_key_pair.deployer: Refreshing state... [id=deployer-key]
google_compute_network.vpc_network: Refreshing state... [id=projects/rackspace-310917/global/networks/terraform-network]
google_compute_firewall.default: Refreshing state... [id=projects/rackspace-310917/global/firewalls/terraform-firewall]
aws_subnet.public-1: Refreshing state... [id=subnet-0b30a1766d057bc51]
aws_internet_gateway.gw: Refreshing state... [id=igw-084ad9c79e469f79e]
aws_security_group.web_nodes: Refreshing state... [id=sg-02573354c48318ad6]
aws_route_table.rt1: Refreshing state... [id=rtb-0cb544419dbd0adca]
aws_route_table_association.association-subnet: Refreshing state... [id=rtbassoc-0d640d14a032dd922]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.aws_web_nodes[0] will be created
  + resource "aws_instance" "aws_web_nodes" {
      + ami                                  = "ami-08962a4068733a2b6"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "deployer-key"
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0b30a1766d057bc51"
      + tags                                 = {
          + "Name" = "web-01"
        }
      + tags_all                             = {
          + "Name" = "web-01"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "ae11a4d7c329ff4f53c76530575d7cb26d6c0737"
      + vpc_security_group_ids               = [
          + "sg-02573354c48318ad6",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # google_compute_instance.vm_instance[0] will be created
  + resource "google_compute_instance" "vm_instance" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = (sensitive)
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            #!/bin/bash
            
            function package_install {
                if [ -e /usr/bin/apt ]; then apt -qq update && apt install -y git ansible python3-pip; fi
                if [ -e /usr/bin/yum ]; then yum -y update && yum install -y git ansible python3-pip; fi
                if [ -e /usr/bin/dnf ]; then dnf -y update ; dnf install -y git ansible python3-pip; fi
            }
            
            function docker_install {
                if [ -e /usr/bin/pip3 ]; then
                  pip3 install docker
                else
                  package_install
                  pip3 install docker
                fi
            }
            
            function repo_checkout {
                if [ ! -e /opt/terraform-demo ]; then
                  git clone https://github.com/racklabs/terraform-demo /opt/terraform-demo
                else
                  pushd /opt/terraform-demo
                  git reset --hard
                  popd
                fi
            }
            
            function run_ansible {
                cd /opt/terraform-demo/ansible
                export ANSIBLE_LOG_PATH=/var/log/ansible.log
                ansible-playbook -i localhost site.yml
            }
            
            package_install
            docker_install
            repo_checkout
            run_ansible
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "web-01"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "https://www.googleapis.com/compute/v1/projects/rackspace-310917/global/networks/terraform-network"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ aws_web_ips    = [
      + (known after apply),
    ]
  ~ google_web_ips = [
      + (known after apply),
    ]
```

</details>

*Pusher: @antonym, Action: `pull_request`*